In [1]:
import pandas as pd

In [2]:
labels = "Python" ,"Dbms", "Dsa"
data= 23 , 56, 78
marks=pd.Series(data,labels)

In [3]:
marks

Python    23
Dbms      56
Dsa       78
dtype: int64

In [4]:
type(marks)

pandas.core.series.Series

In [5]:
g={"Name":'Siya',"Course":'BCA',"Address":'vadodara'}
pd.Series(g)

Name           Siya
Course          BCA
Address    vadodara
dtype: object

In [6]:
marks.keys()

Index(['Python', 'Dbms', 'Dsa'], dtype='object')

In [7]:
marks.values

array([23, 56, 78], dtype=int64)

In [8]:
import numpy as np
h=np.random.randint(0,100,12).reshape(4,3)
h

array([[54, 71, 54],
       [90, 74, 41],
       [69, 48, 32],
       [63,  1, 27]])

In [9]:
df=pd.DataFrame(h,index=["Riya","Rahul","Ramesh","Rohit"],columns=["dsa","stb","cmp"])
df

        dsa  stb  cmp
Riya     54   71   54
Rahul    90   74   41
Ramesh   69   48   32
Rohit    63    1   27

In [10]:
df[['dsa','stb']]

        dsa  stb
Riya     54   71
Rahul    90   74
Ramesh   69   48
Rohit    63    1

In [32]:
df['Total']=df['dsa']+df['stb']+df['cmp']

In [33]:
df['Percentage']=df['dsa']+df['stb']+df['cmp']/3
df

        dsa  stb  cmp  Percentage  Total
Riya     54   71   54  143.000000    179
Ramesh   69   48   32  127.666667    149
Rohit    63    1   27   73.000000     91

In [34]:
df['Percentage']=df['Total']/3
df

        dsa  stb  cmp  Percentage  Total
Riya     54   71   54   59.666667    179
Ramesh   69   48   32   49.666667    149
Rohit    63    1   27   30.333333     91

In [17]:
df.loc['Rahul']

dsa            90.000000
stb            74.000000
cmp            41.000000
Total         205.000000
Percentage     68.333333
Name: Rahul, dtype: float64

In [18]:
df.loc[['Rohit','Riya']]

       dsa  stb  cmp  Total  Percentage
Rohit   63    1   27     91   30.333333
Riya    54   71   54    179   59.666667

In [19]:
df.head(3)

        dsa  stb  cmp  Total  Percentage
Riya     54   71   54    179   59.666667
Rahul    90   74   41    205   68.333333
Ramesh   69   48   32    149   49.666667

In [20]:
df.tail(3)

        dsa  stb  cmp  Total  Percentage
Rahul    90   74   41    205   68.333333
Ramesh   69   48   32    149   49.666667
Rohit    63    1   27     91   30.333333

In [21]:
df.loc['Ramesh':]

        dsa  stb  cmp  Total  Percentage
Ramesh   69   48   32    149   49.666667
Rohit    63    1   27     91   30.333333

In [22]:
df.iloc[2]

dsa            69.000000
stb            48.000000
cmp            32.000000
Total         149.000000
Percentage     49.666667
Name: Ramesh, dtype: float64

In [23]:
df.drop('Percentage',axis=1)

        dsa  stb  cmp  Total
Riya     54   71   54    179
Rahul    90   74   41    205
Ramesh   69   48   32    149
Rohit    63    1   27     91

In [24]:
df

        dsa  stb  cmp  Total  Percentage
Riya     54   71   54    179   59.666667
Rahul    90   74   41    205   68.333333
Ramesh   69   48   32    149   49.666667
Rohit    63    1   27     91   30.333333

In [25]:
df.drop('Total',axis=1,inplace= True)

In [26]:
 df

        dsa  stb  cmp  Percentage
Riya     54   71   54   59.666667
Rahul    90   74   41   68.333333
Ramesh   69   48   32   49.666667
Rohit    63    1   27   30.333333

In [27]:
df.drop('Rahul',axis=0,inplace=True)

In [28]:
df

        dsa  stb  cmp  Percentage
Riya     54   71   54   59.666667
Ramesh   69   48   32   49.666667
Rohit    63    1   27   30.333333

In [93]:
#Create a dataframe of employee salary of basic,Da(10% of basic, HRA(20% of basic) and  total)

In [94]:
import pandas  as pd
data=[10000,40000,20000,60000]
dex=['Riya','Siya','Jiya','Ziya']
t=['Basic']
zx= pd.DataFrame(data,index=dex,columns=t)
zx

      Basic
Riya  10000
Siya  40000
Jiya  20000
Ziya  60000

In [95]:
zx['DA']=zx['Basic']*10/100
zx

      Basic      DA
Riya  10000  1000.0
Siya  40000  4000.0
Jiya  20000  2000.0
Ziya  60000  6000.0

In [96]:
zx['HRA']=zx['Basic']*20/100
zx

      Basic      DA      HRA
Riya  10000  1000.0   2000.0
Siya  40000  4000.0   8000.0
Jiya  20000  2000.0   4000.0
Ziya  60000  6000.0  12000.0

In [97]:
zx['Total']=zx['Basic']+zx['DA']+zx['HRA']
zx

      Basic      DA      HRA    Total
Riya  10000  1000.0   2000.0  13000.0
Siya  40000  4000.0   8000.0  52000.0
Jiya  20000  2000.0   4000.0  26000.0
Ziya  60000  6000.0  12000.0  78000.0

In [98]:
#assignment

In [99]:
import pandas as pd
import numpy as np

In [100]:
product_id=[123,567,435,241,356]
product_name=['Coat','Jacket','shirt','T-shirt','Pant']
product_price=[200,400,600,300,700]
data={'Product_id':product_id,'Product_name':product_name,'Product_price':product_price}
z=pd.DataFrame(data)
z

   Product_id Product_name  Product_price
0         123         Coat            200
1         567       Jacket            400
2         435        shirt            600
3         241      T-shirt            300
4         356         Pant            700

In [101]:
z["Product_name"]

0       Coat
1     Jacket
2      shirt
3    T-shirt
4       Pant
Name: Product_name, dtype: object

In [102]:
z["Product_price"]

0    200
1    400
2    600
3    300
4    700
Name: Product_price, dtype: int64

In [103]:
z["Product_id"]

0    123
1    567
2    435
3    241
4    356
Name: Product_id, dtype: int64

In [104]:
z.iloc[0]

Product_id        123
Product_name     Coat
Product_price     200
Name: 0, dtype: object

In [105]:
z.iloc[1]

Product_id          567
Product_name     Jacket
Product_price       400
Name: 1, dtype: object

In [106]:
z.iloc[2]

Product_id         435
Product_name     shirt
Product_price      600
Name: 2, dtype: object

In [107]:
for row in z.iterrows():
    print(row)

(0, Product_id        123
Product_name     Coat
Product_price     200
Name: 0, dtype: object)
(1, Product_id          567
Product_name     Jacket
Product_price       400
Name: 1, dtype: object)
(2, Product_id         435
Product_name     shirt
Product_price      600
Name: 2, dtype: object)
(3, Product_id           241
Product_name     T-shirt
Product_price        300
Name: 3, dtype: object)
(4, Product_id        356
Product_name     Pant
Product_price     700
Name: 4, dtype: object)

In [108]:
z.loc[1:3,["Product_price"]]

   Product_price
1            400
2            600
3            300

In [109]:
z.iloc[2:5]

   Product_id Product_name  Product_price
2         435        shirt            600
3         241      T-shirt            300
4         356         Pant            700

In [110]:
z.iloc[1:5].drop(['Product_price'],axis=1)

   Product_id Product_name
1         567       Jacket
2         435        shirt
3         241      T-shirt
4         356         Pant

In [111]:
z.iloc[1,[2]]

Product_price    400
Name: 1, dtype: object

In [112]:
z.loc[1:3,['Product_id']]

   Product_id
1         567
2         435
3         241

In [113]:
Subject=["python","Data_Science","DBMS"]
Students=["Riya","Siya","kiya","jiya"]
data=[[14,35,14],[71,24,71],[11,34,19],[82,46,79]]
df=pd.DataFrame(data,index=Students,columns=Subject)
df

      python  Data_Science  DBMS
Riya      14            35    14
Siya      71            24    71
kiya      11            34    19
jiya      82            46    79

In [114]:
df['python']<40

Riya     True
Siya    False
kiya     True
jiya    False
Name: python, dtype: bool

In [115]:
df.loc[df.python<40,'python']=41
df

      python  Data_Science  DBMS
Riya      41            35    14
Siya      71            24    71
kiya      41            34    19
jiya      82            46    79

In [116]:
df+2

      python  Data_Science  DBMS
Riya      43            37    16
Siya      73            26    73
kiya      43            36    21
jiya      84            48    81

In [117]:
df.loc[df.python>50].drop(['Data_Science'],axis=1).drop(['DBMS'],axis=1)

      python
Siya      71
jiya      82

In [118]:
df

      python  Data_Science  DBMS
Riya      41            35    14
Siya      71            24    71
kiya      41            34    19
jiya      82            46    79

In [119]:
df.loc[df.Data_Science>60]

Empty DataFrame
Columns: [python, Data_Science, DBMS]
Index: []

In [120]:
df['Percentage']=(df['python']+df['Data_Science']+df['DBMS'])*1//3

In [121]:
df[df.index.str.startswith('S')]

      python  Data_Science  DBMS  Percentage
Siya      71            24    71          55

In [122]:
df[df.index.str.endswith('a')]

      python  Data_Science  DBMS  Percentage
Riya      41            35    14          30
Siya      71            24    71          55
kiya      41            34    19          31
jiya      82            46    79          69

In [123]:
df

      python  Data_Science  DBMS  Percentage
Riya      41            35    14          30
Siya      71            24    71          55
kiya      41            34    19          31
jiya      82            46    79          69

In [124]:
df.loc[df['Percentage']>40,'Status']='Pass'
df.loc[df['Percentage']<40,'Status']='Fail'

In [125]:
df

      python  Data_Science  DBMS  Percentage Status
Riya      41            35    14          30   Fail
Siya      71            24    71          55   Pass
kiya      41            34    19          31   Fail
jiya      82            46    79          69   Pass

In [126]:
df.loc[df['Percentage']>=90,'Grade']='A'
df.loc[df['Percentage']>=80,'Grade']='B'
df.loc[df['Percentage']>=70,'Grade']='c'
df.loc[df['Percentage']>=60,'Grade']='D'
df.loc[df['Percentage']>=50,'Grade']='E'
df.loc[df['Percentage']<50,'Grade']='F'
df

      python  Data_Science  DBMS  Percentage Status Grade
Riya      41            35    14          30   Fail     F
Siya      71            24    71          55   Pass     E
kiya      41            34    19          31   Fail     F
jiya      82            46    79          69   Pass     E

In [127]:
#df.isnull()
#df.notnull()
#df.dropna() removes row with nan
#df.dropna(axis=1) removes column with nan
#df.dropna(thresh=2) removes row with 2 or more nAn
#df.fillna(value=5) fills 5 in place of nan
#ffill() , bfill() , interpolate()

In [128]:
df.describe()

          python  Data_Science       DBMS  Percentage
count   4.000000      4.000000   4.000000    4.000000
mean   58.750000     34.750000  45.750000   46.250000
std    20.982135      8.995369  33.993872   19.067861
min    41.000000     24.000000  14.000000   30.000000
25%    41.000000     31.500000  17.750000   30.750000
50%    56.000000     34.500000  45.000000   43.000000
75%    73.750000     37.750000  73.000000   58.500000
max    82.000000     46.000000  79.000000   69.000000

In [129]:
metadata=df.dtypes
metadata

python           int64
Data_Science     int64
DBMS             int64
Percentage       int64
Status          object
Grade           object
dtype: object

In [130]:
z.to_dict(orient='list')

{'Product_id': [123, 567, 435, 241, 356],
 'Product_name': ['Coat', 'Jacket', 'shirt', 'T-shirt', 'Pant'],
 'Product_price': [200, 400, 600, 300, 700]}

In [131]:
z['Product_price']+=500
z

   Product_id Product_name  Product_price
0         123         Coat            700
1         567       Jacket            900
2         435        shirt           1100
3         241      T-shirt            800
4         356         Pant           1200

In [ ]:
# TASK 2

In [35]:
import pandas as pd
import numpy as np

In [36]:
f=pd.read_csv("C:/Users/DELL/Downloads/Salaries.csv")

C:\Users\DELL\AppData\Local\Temp\ipykernel_9988\3803362195.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  f=pd.read_csv("C:/Users/DELL/Downloads/Salaries.csv")

In [37]:
f

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [38]:
f=f.replace('Not provided',np.nan)

In [39]:
f=f.replace('Not Provided',np.nan)
f

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,NaN,NaN,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [40]:
f['BasePay']=f['BasePay'].astype('float')

In [41]:
f.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [42]:
f.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148648 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB

In [43]:
f['BasePay'].mean()

66325.4488404877

In [44]:
f['BasePay'].describe()

count    148045.000000
mean      66325.448840
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

In [45]:
f.describe()

,Id,BasePay,TotalPay,TotalPayBenefits,Year,Notes
count,148654.000000,148045.000000,148654.000000,148654.000000,148654.000000,0.0
mean,74327.500000,66325.448840,74768.321972,93692.554811,2012.522643,NaN
std,42912.857795,42764.635495,50517.005274,62793.533483,1.117538,NaN
min,1.000000,-166.010000,-618.130000,-618.130000,2011.000000,NaN
25%,37164.250000,33588.200000,36168.995000,44065.650000,2012.000000,NaN
50%,74327.500000,65007.450000,71426.610000,92404.090000,2013.000000,NaN
75%,111490.750000,94691.050000,105839.135000,132876.450000,2014.000000,NaN
max,148654.000000,319275.010000,567595.430000,567595.430000,2014.000000,NaN

In [46]:
f['OvertimePay']=f['OvertimePay'].astype('float')

In [47]:
f['OvertimePay'].describe()

count    148650.000000
mean       5066.059886
std       11454.380559
min          -0.010000
25%           0.000000
50%           0.000000
75%        4658.175000
max      245131.880000
Name: OvertimePay, dtype: float64

In [52]:
v = f[f['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

In [53]:
v

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [57]:
k = f[f['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits'].values[0]
k

270324.91

In [51]:
h = f.loc[f['TotalPayBenefits'].idxmax()]['EmployeeName']
h

'NATHANIEL FORD'

In [150]:
l = f.loc[f['TotalPayBenefits'].idxmin()]['EmployeeName']
l

'Joe Lopez'

In [69]:
a = f.groupby('Year')['BasePay'].mean()
a

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [152]:
unique = f['JobTitle'].nunique()
unique

2158

In [74]:
t = f['JobTitle'].value_counts().head(5)
t

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

In [76]:
j = f[f['Year'] == 2013]['JobTitle'].value_counts().eq(1).sum()
j

202

In [155]:
ch= f['JobTitle'].str.contains('Chief', case=False, na=False).sum()
ch

627

In [156]:
f['TitleLength'] = f['JobTitle'].apply(lambda x: len(str(x)) if pd.notnull(x) else 0)
correlation = f[['TitleLength', 'TotalPayBenefits']].corr()

In [157]:
correlation

                  TitleLength  TotalPayBenefits
TitleLength          1.000000         -0.036809
TotalPayBenefits    -0.036809          1.000000